johnnyclem/neon-link/sdkconfig.defaults.linksync-tab5
# link-sync on M5Stack Tab5 (ESP32-P4 MIPI-DSI 720×1280 + C6 SDIO).
# Isolated build — does not overwrite S3 / CrowPanel sdkconfig:
#   ./scripts/flash_linksync-tab5.sh
# See docs/LINKSYNC_TAB5.md.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_NEON_BOARD_LINKSYNC_TAB5=y
# CONFIG_NEON_BOARD_CUSTOM is not set
# CONFIG_NEON_BOARD_AMYBOARD is not set
# CONFIG_NEON_BOARD_P4DEVKIT is not set
# CONFIG_NEON_BOARD_LINKSYNC is not set
# CONFIG_NEON_BOARD_LINKSYNC_EPD is not set
# CONFIG_NEON_BOARD_LINKSYNC_P4LCD is not set
# CONFIG_NEON_AUDIO is not set

CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16mb.csv"

# In-package 32 MB PSRAM on P4NRW32 is HEX (same die as CrowPanel).
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Native USB JTAG/serial on the Type-C.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

CONFIG_UART_ISR_IN_IRAM=y

# CONFIG_ETH_USE_ESP32_EMAC is not set

# C6 over SDIO — Tab5 map (not CrowPanel 49–54 / RST 20).
# CONFIG_ESP_HOST_WIFI_ENABLED is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=32
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_PIN_D1=10

# CONFIG_BT_ENABLED is not set
# CONFIG_BT_NIMBLE_ENABLED is not set
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set
